package hillel.homeworks.lesson6;

public class DataGenerator {
    public static Subscriber[] getSubsciberArr() {
        Subscriber[] sub = new Subscriber[10];

        sub[0] =  new Subscriber(1, "Иванов", "Иван", "Иванович", "Киев", "050-111-11-11", "ИИИ-01/01", 0.00d, 30, 60, 200.0f);
        sub[1] =  new Subscriber(2, "Петров", "Петр", "Петрович", "Киев", "050-222-22-22", "ППП-01/01", 100.00d, 0, 120, 0.0f);
        sub[2] =  new Subscriber(3, "Сидоров", "Сидор", "Сидорович", "Киев", "050-333-33-33", "ССС-01/01", -36.00d, 45, 60, 35.0f);
        sub[3] =  new Subscriber(4, "Константинов", "Константин", "Константинович", "Боярка", "050-444-44-44", "ККК-01/01", 505.21d, 125, 356, 200.5f);
        sub[4] =  new Subscriber(5, "Игорев", "Игорь", "Игоревич", "Боярка", "050-555-55-55", "ИИИ-02/01", 156.32d, 0, 0, 125.8f);
        sub[5] =  new Subscriber(6, "Олегов", "Олег", "Олегович", "Вышгород", "050-666-66-66", "ООО-01/01", 0.00d, 0, 0, 0.0f);
        sub[6] =  new Subscriber(7, "Александров", "Александр", "Александрович", "Вышгород", "050-777-77-77", "ААА-01/01", 75.50d, 15, 37, 0.0f);
        sub[7] =  new Subscriber(8, "Юрьев", "Юрий", "Юрьевич", "Харьков", "050-888-88-88", "ЮЮЮ-01/01", -0.50d, 552, 0, 10.0f);
        sub[8] =  new Subscriber(9, "Семенов", "Семон", "Семенович", "Харьков", "050-999-99-99", "ССС-02/01", 0.0d, 0, 0, 42.4f);
        sub[9] =  new Subscriber(10, "Денисов", "Денис", "Денисович", "Харьков", "050-999-99-99", "ССС-02/01", 0.0d, 0, 0, 42.4f);

        return sub;
    }
}
